#+title: Hyprland
#+setupfile: headers
#+PROPERTY: header-args:conf :mkdirp yes :tangle ~/.config/hypr/hyprland.conf :export code :noweb yes
#+PROPERTY: header-args :exports code :tangle no

* Private data                                                     :noexport:
#+name: gen-submap
#+begin_src emacs-lisp :var table=leader-submap submap="leader" reset-submap="yes" :exports none :tangle no :wrap "src conf :exports none :tangle no"
(let ((str-or-null (lambda (value)
                     (cond ((numberp value) (number-to-string value))
                           ((or (null value) (string= "" value)) nil)
                           (t value))))
      (plain-str (lambda (value)
                   (cond ((numberp value) (number-to-string value))
                         ((or (null value) (string= "" value)) nil)
                         (t (string-replace "=" "" value))))))
  (concat (if (not (string= "" submap))
              (concat "submap = " submap "\n")
            "")
          (mapconcat (lambda (line)
                      (let* ((modifiers (or (funcall str-or-null (nth 0 line)) ""))
                             (key           (funcall plain-str   (nth 1 line)))
                             (action        (funcall str-or-null (nth 2 line)))
                             (argument  (or (funcall plain-str   (nth 3 line)) ""))
                             (submap        (funcall str-or-null (nth 4 line)))
                             (bind-flag (or (funcall plain-str   (nth 5 line)) ""))
                             (action-bind (when action
                                            (format "bind%s = %s, %s, %s, %s"
                                                    bind-flag
                                                    modifiers
                                                    key
                                                    action
                                                    argument)))
                             (submap-bind (when submap
                                            (format "bind = %s, %s, submap, %s"
                                                    modifiers
                                                    key
                                                    submap))))
                        (mapconcat #'identity
                                   (seq-filter (lambda (val) (not (null val)))
                                               (list action-bind submap-bind))
                                   "\n")))
                    table
                    "\n")
          (if (string= "yes" reset-submap)
              "\nbind = , escape, submap, reset
bind = CTRL, g, submap, reset"
            "")))
#+end_src

#+RESULTS[16dc2aed068a6e71847eaf331d36c2092f5b0379]: gen-submap
#+begin_src conf :exports none :tangle no
submap = leader
bind = , l, exec, plock
bind = , l, submap, reset
bind = , a, submap, apps
bind = , b, submap, buffers
bind = , w, submap, windows
bind = , escape, submap, reset
bind = CTRL, g, submap, reset
#+end_src

#+name: gen-mouse
#+begin_src emacs-lisp :var table=top-windows-actions
(mapconcat (lambda (line)
             (let ((modifiers (or (nth 0 line) ""))
                   (mouse-btn (nth 1 line))
                   (command   (or (nth 2 line) "")))
               (format "bindm = %s, %s, %s" modifiers mouse-btn command)))
           table
           "\n")
#+end_src

#+RESULTS[bab4997f43c513c6557a8f039ae1e20cc96e7794]: gen-mouse
: bindm = SUPER, mouse:272, movewindow
: bindm = SUPER, mouse:273, resizewindow
